{"id":235,"date":"2018-10-25T23:08:48","date_gmt":"2018-10-25T23:08:48","guid":{"rendered":"http:\/\/melp.org\/?page_id=235"},"modified":"2021-02-16T13:13:39","modified_gmt":"2021-02-16T21:13:39","slug":"melp_faq","status":"publish","type":"page","link":"https:\/\/melp.org\/melp_faq\/","title":{"rendered":"MELPe STANAG-4591 Frequently Asked Questions (FAQ)"},"content":{"rendered":"\n\n\t<h2>FAQ Table Of Content<\/h2>\n<ul>\n<li>\n<h3><a href=\"#Q01\"><b>1. INTRODUCTION AND GENERAL INFORMATION<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q01.0\">1.0 Where can I find more information about the history of Secure Voice Coding?<\/a><\/li>\n<li><a href=\"#Q01.1\">1.1 Where can I find more details about Compandent&#8217;s MELPe package and features (MIPS, memory resources, etc.)?<\/a><\/li>\n<li><a href=\"#Q01.2\">1.2 Where can I find a demo of Compandent&#8217;s MELPe?<\/a><\/li>\n<li><a href=\"#Q01.3\">1.3 What does Compandent&#8217;s MELPe suite include?<\/a><\/li>\n<li><a href=\"#Q01.4\">1.4 On what processors or platforms does your MELPe suite run?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q02\"><b>2. COMPANDENT AND THE MELPe STANDARD<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q02.1\">2.1 Why does Compandent&#8217;s MELPe sound better than the standard reference?<\/a><\/li>\n<li><a href=\"#Q02.2\">2.2 How can I listen to Compandent&#8217;s real-time MELPe vocoder?<\/a><\/li>\n<li><a href=\"#Q02.3\">2.3 Who created the standard Test Vectors, and is your MELPe suite Test Vectors&#8221;certified&#8221;? <\/a><\/li>\n<li><a href=\"#Q02.4\">2.4 How can I verify the Test vectors?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q03\"><b>3. COMPANDET&#8217;S BUSINESS TERMS AND BENEFITS<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q03.1\">3.1 What guarantee or warranty do you offer your customers?<\/a><\/li>\n<li><a href=\"#Q03.2\">3.2 Do you charge for software updates and bug fixes?<\/a><\/li>\n<li><a href=\"#Q03.3\">3.3 Do you charge for technical support?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q04\"><b>4. WORKING WITH THE COMPANDENT&#8217;S MELPe PACKAGE<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q04.1\">4.1 Do I need to reload the MELPe program every time the program is restarted or vocoder mode is changed?<\/a><\/li>\n<li><a href=\"#Q04.2\">4.2 What is the compressed bit format of the MELPe vocoder?<\/a><\/li>\n<li><a href=\"#Q04.3\">4.3 Can we operate the 2400 bps MELPe without using the 1200 bps (or 600 bps) one?<\/a><\/li>\n<li><a href=\"#Q04.4\">4.4 Can we use the 1200 bps (or 600 bps) MELPe without the 2400 bps one?<\/a><\/li>\n<li><a href=\"#Q04.5\">4.5 Can we use the MELPe vocoder without the noise preprocessor?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q05\"><b>5. MELPe VS. MELP<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q05.1\">5.1 Does MELPe sound better than MELP?<\/a><\/li>\n<li><a href=\"#Q05.2\">5.2 Should I use MELP rather than MELPe for legacy compatibility considerations?<\/a><\/li>\n<li><a href=\"#Q05.3\">5.3 Does MELPe have higher delay than MELP? and What is the MELPe delay?<\/a><\/li>\n<li><a href=\"#Q05.4\">5.4 The old MELP is known as MIL-STD-3005, what MIL-STD number is MELPe?<\/a><\/li>\n<li><a href=\"#Q05.5\">5.5 Does MELPe require a lot more meory and MIPS than the old MELP?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q06\"><b>6. MELPe and MELP vs. other vocoders<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q06.1\">6.1 Are MELPe and MELP better than other vocoders such as AMBE, EMBE, STC, SBC and FSHC?<\/a><\/li>\n<li><a href=\"#Q06.2\">6.2 Is MELPe better than older secure voice standards such as FS1015 LPC-10e (2.4kbps), FS1016 CELP (4.8kbps) and CVSD (16kbps)?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q07\"><b>7. THE REQUIRED SW\/HW ENVIRONMENT FOR COMPANDENT&#8217;S MELPe<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q07.1\">7.1 What operating system, kernel, RTOS environment or host PC is needed to run your MELPe suite?<\/a><\/li>\n<li><a href=\"#Q07.2\">7.2 In order for you to provide support for example, do you require Companden&#8217;s MELPe customers to purchase additional (potentially expensive) &#8220;peripheral&#8221; software, HPI, interface with other software such as Matlab, HyperSignal etc.?<\/a><\/li>\n<li><a href=\"#Q07.3\">7.3 Does Compandent&#8217;s MELPe package run under TI&#8217;s Code Composer Studio (CCS)?<\/a><\/li>\n<li><a href=\"#Q07.4\">7.4 What specific system or hardware is required to run Compandent&#8217;s MELPe suite?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q08\"><b>8. DSP AND DEVELOPMENT BOARD FOR COMPANDENT&#8217;S MELPe<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q08.1\">8.1 Which DSP would you recommend for MELPe, TMS320c54xx or TMS320c55xx?<\/a><\/li>\n<li><a href=\"#Q08.2\">8.2 Would you recommend any specific DSP development board?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q09\"><b>9. CHIPS AND STANDALONE DEVICES OR SYSTEMS WITH COMPANDENT&#8217;S MELPe<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q09.1\">9.1 Can you provide MELPe vocoder chips?<\/a><\/li>\n<li><a href=\"#Q09.2\">9.2 Can you provide MELPe vocoder boards?<\/a><\/li>\n<li><a href=\"#Q09.3\">9.3 Is there any MELPe standalone device available?<\/a><\/li>\n<li><a href=\"#Q09.4\">9.4 Do you offer wireless communication based MELPe systems?<\/a><\/li>\n<li><a href=\"#Q09.5\">9.5 Do you offer MELPe systems with Video Modules + GSM\/GPRS + GPS + Network Modules + Mass Storage Modules?<\/a><\/li>\n<li><a href=\"#Q09.6\">9.6 Do you offer high density MELPe boards (say 100-200 channels) for VoIP Servers or Gateways?<\/a><\/li>\n<li><a href=\"#Q09.7\">9.7 Do you offer MELPe based high-density telephony boards?<\/a><\/li>\n<li><a href=\"#Q09.8\">9.8 Do you offer MELPe based VoIP Radio Interoperability Gateways?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q10\"><b>10. MULTI-CHANNEL AND MULTI-THREAD MELPe IMPLEMENTATIONS<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q10.1\">10.1 What DSP or platform would you recommend for multi-channel MELPe?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q11\"><b>11. MELPe IPR AND LICENSING COMPANDENT&#8217;S MELPe<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q11.1\">11.1 Suppose I developed MELPe implementation based on the standard, or obtained such from some source other than Compandent and I use it commercially, do I still need to pay any royalty to Compandent? (where commercially means any use other than the U.S. government or NATO or Partnership for Peace governments)<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q12\"><b>12. IMPORTANT NOTES TO DEFENSE CONTRACTOR RE MELP \/ MELPe<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q12.1\">12.1 Is MELP \/ MELPe HW &amp; SW COTS and\/or POSIX?<\/a><\/li>\n<li><a href=\"#Q12.2\">12.2 Why is Compandent&#8217;s MELP \/ MELPe package better?<\/a><\/li>\n<li><a href=\"#Q12.3\">12.3 What should defense contractor management be aware of?<\/a><\/li>\n<li><a href=\"#Q12.4\">12.4 How can I quickly hook-up and test your MELPe with military equipment?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q13\"><b>13. BIT ERRORS AND FRAME ERASURE <\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q13.1\">13.1 Does MELPe utilize error correction coding?<\/a><\/li>\n<li><a href=\"#Q13.2\">13.2 What about Frame Erasure, Burst Error, and Error Concealment?<\/a><\/li>\n<\/ul>\n<\/li>\n<li>\n<h3><a href=\"#Q14\"><b>14. OTHER MELPe RELATED SOFTWARE AND FEATURES<\/b><\/a><\/h3>\n<ul>\n<li><a href=\"#Q14.1\">14.1 Can Compandent&#8217;s MELPe be used as variable-rate coder?<\/a><\/li>\n<\/ul>\n<ul>\n<li><a href=\"#Q14.2\">14.2 Can you transcode between MELPe and other coders such as G.729D, or other G.7xx?<\/a><\/li>\n<\/ul>\n<ul>\n<li><a href=\"#Q14.3\">14.3 How can I perform bitstream sync acquisition that would work even in noisy channel conditions (i.e. in the presence of bit error)?<\/a><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h2>Frequently Asked Questions<\/h2>\n<h3><a name=\"Q01\"><\/a>1. INTRODUCTION AND GENERAL INFORMATION<\/h3>\n<b> <a name=\"Q01.0\"><\/a>1.0 Q: Where can I find more information about the history of Secure Voice Coding?<\/b><br \/>\nA: See <a href=\"https:\/\/www.nsa.gov\/Portals\/70\/documents\/about\/cryptologic-heritage\/historical-figures-publications\/publications\/wwii\/sigsaly_history.pdf\">A History of Secure Voice Coding: Insights Drawn from the Career of One of the Earliest Practitioners of the Art of Speech Coding<\/a>.\n<b> <a name=\"Q01.1\"><\/a>1.1 Q: Where can I find more details about Compandent&#8217;s MELPe package and features (MIPS, memory resources, etc.)?<\/b><br \/>\nA: See <a href=\"https:\/\/melp.org\/\">www.MELPe.com<\/a> or for more details:<br \/>\n<a href=\"https:\/\/melpe.org\/pdf\/MELPePackageFactSheet.pdf\"> (a) for c54xx\/c55xx, C64x+ (such as C674x C672x etc.), and OMAP (c55x based, c64x+ based etc..): MELPePackageFactSheet.pdf<\/a><br \/>\n<a href=\"https:\/\/melpe.org\/pdf\/MELPePackageFactSheet6416.pdf\"> (b) for c64xx: MELPePackageFactSheet6416.pdf<\/a><br \/>\n<a href=\"https:\/\/melp.org\/melpesw\/\"> (c) for Analog Devices BlackFin ADSP-BF561 and TigerSharc (TS101, TS20x, etc.)<\/a><br \/>\n<a href=\"https:\/\/melp.org\/melpesw\/\"> (d) for ARM Processors, GHS PowerPC<\/a>, <a href=\"https:\/\/melp.org\/mobileapp\/\">Android, Apple iOS<\/a><br \/>\n<a href=\"https:\/\/melpe.org\/pdf\/MELPePackageFactSheetPOSIX.pdf\"> (e) All other processors and OS (Unix, Linux, Windows PC, MacOS, etc.)<\/a>\n<b> <a name=\"Q01.2\"><\/a>1.2 Q: Where can I find a demo of Compandent&#8217;s MELPe?<\/b><br \/>\nA: You may listen to our MELPe&#8217;s audio demo at: <a href=\"https:\/\/melp.org\/melpesw\/#MELPeDemo\">www.MELPe.com<\/a>\n<b> <a name=\"Q01.3\"><\/a>1.3 Q: What does Compandent&#8217;s MELPe suite include?<\/b><br \/>\nA: Compandent&#8217;s MELPe suite includes optional components such as MELPe encoder and\/or decoder at rates of 2400, 1200 and\/or 600 bps, optional transcoding between rates, and optional noise preprocessor. Our package was mostly written and optimized in Assembly language for different DSPs, it is C callable (far call) and self initialized. It includes main C programs for processing files and for real-time demo, comprehensive manual, the &#8220;certified&#8221; Test Vectors, Compandent&#8217;s professional support (provided by the same world-class DSP and speech coding experts who participated in creating the MELPe standard), etc.. We also offer Compandent&#8217;s MELPe suite for other platforms such as <a href=\"https:\/\/melpe.org\/pdf\/MELPePackageFactSheetPOSIX.pdf\">Windows, Unix, Linux, MacOS<\/a> etc..\n<b> <a name=\"Q01.4\"><\/a>1.4 Q: On what processors or platforms does your MELPe suite run?<\/b><br \/>\nA: We have ported the MELPe to various processors and platforms including Texas Instruments&#8217; TMS320c54xx, TMS320c55xx, TMS320c64xx, C64x+ (such as C674x C672x etc.), and OMAP (c55x based, c64x+ based etc..), Analog Devices BlackFin ADSP-BF561 and TigerSharc (TS101, TS20x, etc.), <a href=\"https:\/\/www.microchip.com\/design-centers\/wireless-connectivity\/embedded-wi-fi\/pic32mz-w1f\">Microchip PIC32MZ<\/a>, <a href=\"\/mobileapp\/\">ARM, Android, iOS<\/a>, GHS PowerPC <a href=\"\/pdf\/MELPePackageFactSheetPOSIX.pdf\">Windows, Unix, Linux and Apple  MacOS<\/a>. Our multi-channel MELPe implementations takes about 5%-15% real-time with today&#8217;s CPUs such as Pentium 4, AMD, Ultra Sparc, etc.. We can port it to any needed platform.\n\n<h3><a name=\"Q02\"><\/a>2. COMPANDENT AND THE MELPe STANDARD<\/h3>\n<b> <a name=\"Q02.1\"><\/a>2.1 Q: Why does Compandent&#8217;s MELPe sound better than the standard reference?<\/b><br \/>\nA. Compandent has been working on the MELPe package for many years now (since 2001). We have extensively tested our MELPe suite (a.k.a <strong>MELPe++<\/strong> or <strong>MELPe-Plus-Plus<\/strong>) in many different environments and with a variety of speech data. We can show you examples where the standard reference produces hoarse speech or annoying clicks while Compandent&#8217;s MELPe (MELPe++) produces much better sounding and cleaner speech. We thoroughly investigated any sign of a problem or bug and didn&#8217;t give up until we resolved it in the best possible way, in order to make sure that our customers get the best sounding implementation! In fact, even combining Compandent&#8217;s MELPe++ in a system that already uses MELP or MELPe on the other end is likely to improve quality on both ends! (compared to MELP or MELPe standard reference on both ends)\n<b> <a name=\"Q02.2\"><\/a>2.2 Q: How can I listen to Compandent&#8217;s real-time MELPe vocoder?<\/b><br \/>\nA: Our package includes a main C program that runs the MELPe in real-time. You may run it, listen to it in real time, and even switch its configurations on the fly without reloading it.\n<b> <a name=\"Q02.3\"><\/a>2.3 Q: Who created the standard Test Vectors, and is your MELPe suite Test Vectors &#8220;certified&#8221;? <\/b><br \/>\nA: Excellent question! Compandent has contributed to the MELPe standard reference, and kept doing subsequent MELPe-related project for the US DoD. In fact, <b>Compandent has created the standard reference&#8217;s &#8220;certified&#8221; Test Vectors<\/b>. Throughout our work over the years, we extensively improved and tested our MELPe implementation using additional data bases that are very relevant to the MELPe customers and applications.\n<b> <a name=\"Q02.4\"><\/a>2.4 Q: How can I verify the Test vectors?<\/b><br \/>\nA: Our package includes a main C program that processes Test Vector files. You may run it and then compare its output to the provided reference Test Vectors.\n\n<h3 align=\"left\"><a name=\"Q03\"><\/a>3. COMPANDENT&#8217;S BUSINESS TERMS AND BENEFITS<\/h3>\n<b> <a name=\"Q03.1\"><\/a>3.1 Q: What guarantee or warranty do you offer your customers?<\/b><br \/>\nA: We provide a 30 day money back guarantee that our MELPe performs according to our specifications, namely that it passes the Test Vectors, and meets the specified memory and MIPS requirements.\n<b> <a name=\"Q03.2\"><\/a>3.2 Q: Do you charge for software updates and bug fixes?<\/b><br \/>\nA: No! We want our customers to have the best implementation. When a bug fix or update is made, we provide it to our customers without charge for the lifetime of the product!\n<b> <a name=\"Q03.3\"><\/a>3.3 Q: Do you charge for technical support?<\/b><br \/>\nA: Normally not. We provide free support to our customers for a reasonable period that is more than sufficient for them to successfully integrate our MELPe suite into their product.\n\n<h3 align=\"left\"><a name=\"Q04\"><\/a>4. WORKING WITH COMPANDENT&#8217;S MELPe PACKAGE<\/h3>\n<b> <a name=\"Q04.1\"><\/a>4.1 Q: Do I need to reload the MELPe program every time the program is restarted or vocoder mode is changed?<\/b><br \/>\nA: No, you may simply re-run it and it initializes itself without a need to be reloaded.\n<b> <a name=\"Q04.2\"><\/a>4.2 Q: What is the compressed bit format of the MELPe vocoder?<\/b><br \/>\nA: Included with Compandent&#8217;s MELPe suite is a detailed manual that explains the MELPe compressed bit format.\n<b> <a name=\"Q04.3\"><\/a>4.3 Q: Can we operate the 2400 bps MELPe without using the 1200 bps (or 600 bps) one?<\/b><br \/>\nA: Yes, in fact you may save much memory and MIPS by using the 2400 bps only.\n<b> <a name=\"Q04.4\"><\/a>4.4 Q: Can we use the 1200 bps (or 600 bps) MELPe without the 2400 bps one?<\/b><br \/>\nA: Yes, but your savings may be negligible if any, since the 1200 bps (or 600 bps) vocoder is a superset of the 2400 bps and is based on it anyway.\n<b> <a name=\"Q04.5\"><\/a>4.5 Q: Can we use the MELPe vocoder without the noise preprocessor?<\/b><br \/>\nA: Yes, and by doing so one may save some memory, MIPS and may need to license less IPR.\n\n<h3 align=\"left\"><a name=\"Q05\"><\/a>5. MELPe VS. MELP<\/h3>\n<b> <a name=\"Q05.1\"><\/a>5.1 Q: Does MELPe sound better than MELP?<\/b><br \/>\nA: Yes, the 2400 bps MELPe sounds better than the MELP. Furthermore, Compandent&#8217;s MELPe suite (a.k.a <strong>MELPe++<\/strong> or <strong>MELPe-Plus-Plus<\/strong>) sounds even better, since over the past years we have fixed numerous bugs and issues in MELPe, some of which even originated from the old MELP. We can show you examples where the MELP and MELPe standard reference produces hoarse speech or annoying clicks while Compandent&#8217;s MELPe (MELPe++) produces much better sounding and cleaner speech.\n<b> <a name=\"Q05.2\"><\/a>5.2 Q: Should I use MELP rather than MELPe for legacy compatibility considerations?<\/b><br \/>\nA: At 2400 bps the MELPe and MELP uses a similar bit format, therefore a MELPe synthesizer would produce better quality speech than the MELP synthesizer for the same bit-stream. In other words, even if you communicate with a MELP based legacy device, you will improve the speech quality by utilizing a MELPe based new device on your end. So we would certainly recommend using MELPe rather than MELP. Furthermore, combining Compandent&#8217;s MELPe++ in a system that already uses MELP (or even MELPe standard reference) on the other end is likely to improve quality on both ends! (compared to MELP or MELPe standard reference on both ends)\n<b> <a name=\"Q05.3\"><\/a>5.3 Q: Does MELPe have higher delay than MELP? and What is the MELPe delay?<\/b><br \/>\nA: At 2400 bps both MELPe and MELP have the same delay. The encoder (algorithmic) delay of MELPe is 42.625ms, 103.75ms and 126.25ms for the 2400, 1200 and 600 bps MELPe, respectively. The total end-to-end delay depends on how one computes it, and that may vary among different networks having different packet size and different delay, buffering, and processing. We can explain to you how the US DoD and NATO typically compute the MELP &amp; MELPe delay in their networks, and how you may compute the end-to-end MELPe delay in your network. Included with Compandent&#8217;s MELPe suite is a detailed manual that explains the MELP &amp; MELPe delay. For more information please call us or <a href=\"https:\/\/melp.org\/contact\/\">contact us<\/a>.\n<b> <a name=\"Q05.4\"><\/a>5.4 The old MELP is known as MIL-STD-3005, what MIL-STD number is MELPe?<\/b><br \/>\nA: Both <a href=\"https:\/\/melp.org\/wp-content\/uploads\/2019\/02\/MIL-STD-3005-MELP.pdf\">MELP<\/a> and MELPe are known as <a href=\"https:\/\/melp.org\/wp-content\/uploads\/2019\/02\/MIL-STD-3005-MELP.pdf\">MIL-STD-3005<\/a>. The <a href=\"https:\/\/melp.org\/wp-content\/uploads\/2019\/02\/MIL-STD-3005-MELP.pdf\">MIL-STD-3005<\/a> is their US DoD standard number. The MELPe is a newer and enhanced version of MIL-STD-3005. So if your project includes specifications for <a href=\"\/wp-content\/uploads\/2019\/02\/MIL-STD-3005-MELP.pdf\">MIL-STD-3005<\/a> that were written after the year 2001, they most likely refer to the MELPe rather than to the old MELP. The MELPe is also known as STANAG 4591, which is its NATO standard number. For more information please call us or <a href=\"https:\/\/melp.org\/contact\/\">contact us<\/a>.\n<b> <a name=\"Q05.5\"><\/a>5.5 Does MELPe require a lot more memory and MIPS than the old MELP?<\/b><br \/>\nA: Not necessarily, that depends on what we are comparing. At 2400 bps both MELPe and <a href=\"https:\/\/melp.org\/wp-content\/uploads\/2019\/02\/MIL-STD-3005-MELP.pdf\">MELP<\/a> require similar memory and MIPS, so if you are required to use 2400 bps vocoder, then you would only benefit by using MELPe rather than the old MELP. The lower rates MELPe require similar amount of MIPS, but more memory (mainly ROM tables) than the 2400 bps. The MELPe&#8217;s optional Noise-PreProcessing (NPP) may also add to the required memory and MIPS. For more information please see our <a href=\"https:\/\/melpe.org\/pdf\/MELPePackageFactSheet.pdf\"> factsheet<\/a> or call us or <a href=\"https:\/\/melp.org\/contact\/\">contact us<\/a>.\n\n<h3 align=\"left\"><a name=\"Q06\"><\/a>6. MELPe and MELP vs. other vocoders<\/h3>\n<b> <a name=\"Q06.1\"><\/a>6.1 Q: Are MELPe and MELP better than other vocoders such as AMBE, EMBE, STC, SBC and FSHC??<\/b><br \/>\nA: Yes, in 1996 <a href=\"\/wp-content\/uploads\/2019\/02\/MIL-STD-3005-MELP.pdf\">MELP<\/a> won the US DoD <a href=\"https:\/\/melp.org\/wp-content\/uploads\/2019\/02\/MIL-STD-3005-MELP.pdf\">MIL-STD-3005<\/a> standard competition against other candidate vocoders such as (a) Frequency Selective Harmonic Coder (FSHC), (b) Advanced Multiband Excitation (AMBE), (c) Enhanced Multiband Excitation (EMBE), (d) Sinusoid Transform Coder (STC), and (e) Subband LPC Coder (SBC). Under the US DoD&#8217;s extensive testing MELP received the highest score and was eventually selected as the standard. Several years later, the enhanced-MELP (MELPe) was developed and even surpassed the MELP&#8217;s quality. Hence at bitrates of 2400, 1200, and 600, MELPe is the best vocoder available in real-time DSP implementation.\n<b> <a name=\"Q06.2\"><\/a>6.2 Q: Is MELPe better than the old secure voice standards such as FS1015 LPC-10e (2.4 kbps), FS1016 CELP (4.8 kbps) and CVSD (16 kbps)?<\/b><br \/>\nA: Yes, in 2002 as part of NATO testing for new NATO standard, MELPe was tested against other candidates such as France&#8217;s HSX (Harmonic Stochastic eXcitation) and Turkey&#8217;s SB-LPC (Split-Band Linear Predictive Coding), as well as the old secure voice standards such as FS1015 LPC-10e (2.4 kbps), FS1016 CELP (4.8 kbps) and CVSD (16 kbps). Subsequently, the MELPe won also the NATO competition, surpassing the quality of all other candidates as well as the quality of all old secure voice standards (CVSD, CELP and LPC-10e). The NATO competition concluded that MELPe substantially improved performance (in terms of speech quality, intelligibility, and noise immunity), while reducing throughput requirements. The NATO testing also included interoperability tests, used over 200 hours of speech data, and was conducted by 3 test laboratories world wide.\n\n\n\n<h3 align=\"left\"><a name=\"Q07\"><\/a>7. THE REQUIRED SW\/HW ENVIRONMENT FOR COMPANDENT&#8217;S MELPe<\/h3>\n<b> <a name=\"Q07.1\"><\/a>7.1 Q: What operating system, kernel, RTOS environment or host PC is needed to run your MELPe suite?<\/b><br \/>\nA: None! Our suite does not require and is not limited to any kernel or other specific environment, and does not consume precious memory for such. It uses C callable (far call) or Assembly callable functions, and you may simply and easily integrate it to any program or environment. As a part of our suite we provide example of main C programs that runs the MELPe vocoder, which you may use as guidelines for your application and its integration.\n<b> <a name=\"Q07.2\"><\/a>7.2 Q: In order for you to provide support for example, do you require Companden&#8217;s MELPe customers to purchase additional (potentially expensive) &#8220;peripheral&#8221; software, HPI, interface with other software such as Matlab, HyperSignal etc.?<\/b><br \/>\nA: No we do not play such games! We do not waste our customers&#8217; time and money on such unnecessary &#8220;peripheral&#8221; software or GUI, that is not much useful for and is commonly irrelevant to the customer&#8217;s actual product. One may choose to use such and we can provide such, but we don&#8217;t suggest that as necessary. We provide our customers with a complete and robust and yet the most concise and efficient suite that contains all they <b>really need<\/b>, in order to allow them the fastest and easiest integration in moving forward with their product development, saving them development cost, and minimizing their time-to market!\n<b> <a name=\"Q07.3\"><\/a>7.3 Q: Does Compandent&#8217;s MELPe package run under TI&#8217;s Code Composer Studio (CCS)?<\/b><br \/>\nA: Yes, of course. Our suite is CCS ready, and we provide all the necessary GEL and project files. You may compile, load, run, and profile it under CCS. You may even process files or run it in real-time under CCS.\n<b> <a name=\"Q07.4\"><\/a>7.4 Q: What specific system or hardware is required to run Compandent&#8217;s MELPe suite?<\/b><br \/>\nA: No specific hardware is needed. You may use your own target hardware or PC. For quick demo and development system we recommend you to start with <a href=\"https:\/\/www.ti.com\/tool\/TMDSDSK5416\">TI&#8217;s DSKs<\/a>.\n\n<h3 align=\"left\"><a name=\"Q08\"><\/a>8. DSP AND DEVELOPMENT BOARD FOR COMPANDENT&#8217;S MELPe<\/h3>\n<b> <a name=\"Q08.1\"><\/a>8.1 Q: Which DSP would you recommend for MELPe, TMS320c54xx or TMS320c55xx?<\/b><br \/>\nA: You may use either one (or another DSP of your choice). Some use the TMS320c54xx for legacy considerations. (The TMS320c5416 is very popular). But for future considerations, we recommend using the TMS320c55xx, since the TMS320c55xx provides some advantages such as larger and more flexible memory space (which is particularly important if you use the complete MELPe suite and your product uses lots of additional Data RAM). The TMS320c55xx is even cheaper than the TMS320c54xx since TI is interested in advancing its adoption. Compandent offers its MELPe suite also for the TI&#8217;s TMS320c64xx DSP, as well as Analog Devices BlackFin ADSP-BF561 and TigerSharc (TS101, TS20x, etc.), <a href=\" https:\/\/www.microchip.com\/design-centers\/wireless-connectivity\/embedded-wi-fi\/pic32mz-w1\">Microchip PIC32MZ<\/a>, <a href=\"\/mobileapp\/\">ARM, Android, Apple iOS<\/a>, and GHS PowerPC.\n<b> <a name=\"Q08.2\"><\/a>8.2 Q: Would you recommend any specific DSP development board?<\/b><br \/>\nA: For DSP implementation we suggest using TI\/Spectrum Digital&#8217;s DSKs, which are really nice and reliable packages that include an easy to install development board, TI&#8217;s Code Composer Studio (CCS), USB port, A\/D\/A converters, LEDs, DIP switches, and expansion headers for various purposes and\/or daughter-cards such as Ethernet port, USB, RS232, RS422, parallel port, external codecs and many more. They also include schematics, should you need such for designing your product. Their cost is very reasonable! See for example:<br \/>\n<a href=\"https:\/\/www.ti.com\/tool\/TMDSDSK5416\">DSK for TMS320c5416<\/a>,<br \/>\n<a href=\"https:\/\/www.ti.com\/tool\/TMDSDSK5510\">DSK for TMS320c5510<\/a><br \/>\n<a href=\"https:\/\/www.ti.com\/tool\/TMDSDSK5416\">DSK for TMS320c6416<\/a><br \/>\n<a href=\"http:\/\/www.spectrumdigital.com\/tms320c5515-evaluation-module\/\">TMS320VC5515 DSP Evaluation Module<\/a>, available from TI<br \/>\n<a href=\"http:\/\/www.spectrumdigital.com\/product_info.php?cPath=27&amp;products_id=39&amp;osCsid=86402a733df56c7bbae3ba2b705dc442\">OMAP5912 Starter Kit (DSK)<\/a>, also available from <a href=\"http:\/\/focus.ti.com\/docs\/toolsw\/folders\/print\/tmdsosk5912.html\">TI<\/a><br \/>\n<a href=\"http:\/\/www.spectrumdigital.com\/tms320c6424-evaluation-module\/\">TMS320C6424 Evaluation Module<\/a>, also available from <a href=\"http:\/\/focus.ti.com\/docs\/toolsw\/folders\/print\/tmdsevm6424.html\">TI<\/a><br \/>\n<a href=\"http:\/\/www.spectrumdigital.com\/tms320c6474-evaluation-module\/\">TMS320C6474 Evaluation Module<\/a>, also available from <a href=\"http:\/\/focus.ti.com\/docs\/toolsw\/folders\/print\/tmdxevm6474.html\">TI<\/a><br \/>\n<a href=\"https:\/\/www.ti.com\/tool\/TMDSOSKL137\">TMDSOSKL137 OMAP-L137\/TMS320C6747 Floating Point Starter Kit<\/a><br \/>\n<a href=\"https:\/\/www.ti.com\/tool\/TMDSLCDK138\">TMDSLCDK138 OMAP-L138 development kit (LCDK)<\/a><br \/>\n<a href=\"http:\/\/www.ti.com\/tool\/tmdxlcdk6748?DCMP=dsp-anniv-120901&amp;HQS=dsp-anniv-em-sw1\">TMS320C6748 DSP Development Kit (LCDK) <\/a><br \/>\n<a href=\"https:\/\/processors.wiki.ti.com\/index.php\/L138\/C6748_Development_Kit_%28LCDK%29\">OMAP-L138 Development Kit (LCDK) <\/a><br \/>\n<a href=\"http:\/\/www.analog.com\/en\/design-center\/evaluation-hardware-and-software\/evaluation-boards-kits\/BF561-EZLITE.html#eb-overview\">Analog Devices EZ-KIT Lite Evaluation Kit for ADSP-BF561 Blackfin Processor<\/a><br \/>\n<a href=\"http:\/\/www.analog.com\/en\/design-center\/evaluation-hardware-and-software\/evaluation-boards-kits\/TS201S-EZLITE.html#eb-overview\">Analog Devices EZ-KIT Lite Evaluation Kit for ADSP-TS201S TigerSharc Processor<\/a><br \/>\nCompandent offers its customers with real-time demos of MELPe running on these boards.\n\n<h3 align=\"left\"><a name=\"Q09\"><\/a>9. CHIPS, BOARDS, STANDALONE DEVICES OR SYSTEMS WITH COMPANDENT&#8217;S MELPe<\/h3>\n<b> <a name=\"Q09.1\"><\/a>9.1 Q: Can you provide MELPe vocoder chips?<\/b><br \/>\nA: Yes, we work with TI&#8217;s excellent team to provide our customer specific MELPe vocoder based chips at a very reasonable cost. For more details, please call us or <a href=\"\/contact\/\">contact us<\/a>.\n<b> <a name=\"Q09.2\"><\/a>9.2 Q: Can you provide MELPe vocoder boards?<\/b><br \/>\nA: Yes, we can provide you with boards having one DSP, and up to high density boards having up to 240 MELPe channels. For more details, please call us or <a href=\"https:\/\/melp.org\/contact\/\">contact us<\/a>.\n<b> <a name=\"Q09.3\"><\/a>9.3 Q: Is there any MELPe standalone device available?<\/b><br \/>\nA: Yes, Compandent offers low-cost Data-Terminal Equipment (DTE) such as <a href=\"\/melpehw\/\">FLEXI-232<\/a> and <a href=\"\/melpehw\/\">FLEXI-PC104<\/a> for interfacing MELPe vocoders with external devices such as Rockwell Collins MDM-3001 and other modems. Also, Compandent has designed and manufactures such a portable device called MELCODER. We designed it for the US DoD and NATO needs. The MELCODER is considered the &#8220;golden standard&#8221; for MELPe communications by the US DoD and NATO. The MELCODER offers full duplex MELPe communications at each of the two rates, transcoding between the rates, activation or bypass of the noise preprocessor and the postfilter. It also offers on board PCM codec or PCM exchanged with external device or work station. One may conduct field or lab testing using it, or set a complete MELPe network using MELCODER devices. We can also provide you with cost effective solutions to feed MELPe data to your system (modem etc.), and we can implement customized interface for your needs. For more details about Compandent&#8217;s MELCODER device please call us or <a href=\"\/contact\/\">contact us<\/a>.\n<b> <a name=\"Q09.4\"><\/a>9.4 Q: Do you offer wireless communication and Ethernet based MELPe systems?<\/b><br \/>\nA: Yes, Compandent&#8217;s <a href=\"https:\/\/melp.org\/melpehw\/\">FLEXI-232<\/a> and <a href=\"https:\/\/melp.org\/melpehw\/\">FLEXI-PC104<\/a> is an extremely versatile board that can be programmed to handle any required standard or customized communication protocol (beyond what a typical DSP may be capable of) including RS-232, RS-422, RS-423, USB, <a href=\"https:\/\/www.digi.com\/products\/embedded-systems\/system-on-modules\/digiconnectme9210\">TCP-IP Ethernet, 802.11b\/g Wireless<\/a>, etc.. It also has user friendly control and set-up interface. In addition, the FLEXI-232 (and FLEXI-PC104) has general purpose I\/O lines that can be customized to your special needs. It can be also delivered as a standalone portable device in appropriate enclosure. For more details please call us or <a href=\"\/contact\/\">contact us<\/a>.\n<b> <a name=\"Q09.5\"><\/a>9.5 Q: Do you offer MELPe systems with Video Modules + GSM\/GPRS + GPS + Network Modules + Mass Storage Modules? <\/b><br \/>\nA: Yes, Compandent and one of our partners have created a complete MELPe + Video Modules + GSM\/GPRS + GPS + Network Modules + Mass Storage Modules system solution that runs under Linux, and includes optional connectors and slots for PC-104, EIDE, PCI, ISA, various ports for USB, mouse, keyboard, serial, Ethernet, and hard-drive. For more details about <a href=\"https:\/\/www.rtd.com\/PC104\/pc104menu.htm\">available modules and features please visit this page<\/a> , call us or <a href=\"\/contact\/\">contact us<\/a>.\n<b> <a name=\"Q09.6\"><\/a>9.6 Q: Do you offer high density MELPe boards (say 100-200 channels) for VoIP Servers or Gateways? <\/b><br \/>\nA: Yes, Compandent and one of our partners offer up to 240-port, 6400 MIPS, DSP PMC (PCI Mezzanine Card) form factor utilizing C5441 DSPs with on-board 400 Mhz PowerPC. A fully embedded telephony software library is also available for VoIP, V.22 and V.90 Modem, Fax, Conferencing, Telephony, MELPe and more. For more details please call us or <a href=\"https:\/\/melp.org\/contact\/\">contact us<\/a>.\n<b> <a name=\"Q09.7\"><\/a>9.7 Q: Do you offer MELPe based high-density telephony boards? <\/b><br \/>\nA: Yes, Compandent and one of our partners offer a switched high density FXO telephone network interface controller card providing multiple 2 wire subscriber side loop start, ground start or CAMA trunks. An optional DSP provides telephony signaling and VoIP functionality. The board operates in conventional cPCI host bus or 2.16 PSB modes. Featured functions (a) 2:4 wire conversion and ring detection, (b) Telephone off hook, flash and dial pulse signaling generation, (c) Integral TSI provides line-line switching and access to the backplane H.110 bus, (d) Dual 10\/100 Ethernet connections, and (e) T1\/E1 ISDN channel bank operation. For more details please call us or <a href=\"https:\/\/melp.org\/contact\/\">contact us<\/a>.\n<b> <a name=\"Q09.8\"><\/a>9.8 Q: Do you offer MELPe based VoIP Radio Interoperability Gateways? <\/b><br \/>\nA: Yes, Compandent and one of our partners offer a VoIP Radio Interoperability Gateway featuring universal radio control, VoIP Gateway and a customizable command and control GUI to a wide range of domestic and foreign customers. For more details please call us or <a href=\"https:\/\/melp.org\/contact\/\">contact us<\/a>.\n\n<h3 align=\"left\"><a name=\"Q10\"><\/a>10. MULTI-CHANNEL AND MULTI-THREAD MELPe IMPLEMENTATIONS<\/h3>\n<b> <a name=\"Q10.1\"><\/a>10.1 Q: What DSP or platform would you recommend for multi-channel MELPe?<\/b><br \/>\nA: Compandent provides multi-channel MELPe implementation on all platforms! The number of channels per DSP may vary from one DSP to another, and it is also dependent on the MELPe components that you would like to run per channel and whether you need full-duplex or half-duplex channel. On the <a href=\"https:\/\/melpe.org\/pdf\/MELPePackageFactSheet.pdf\">c54xx<\/a> you will have more restrictions on the number of channels (up to 3 full-duplex or 6 half-duplex), while on the <a href=\"https:\/\/melpe.org\/pdf\/MELPePackageFactSheet.pdf\">c55xx<\/a>, <a href=\"https:\/\/melpe.org\/pdf\/MELPePackageFactSheet6416.pdf\">c64xx, C64x+ (such as C674x C672x etc.), or OMAP (c55x based, c64x+ based (L-137 L-1328) etc..)<\/a> you may have much more flexibility. Our MELPe is also offerd on Analog Devices BlackFin ADSP-BF561 and TigerSharc (TS101, TS20x, etc.), <a href=\"https:\/\/www.microchip.com\/design-centers\/wireless-connectivity\/embedded-wi-fi\/pic32mz-w1\">Microchip PIC32MZ<\/a>, <a href=\"\/mobileapp\/\">ARM, Android, Apple iOS<\/a> and GHS PowerPC. We also offer multi-channel multi-thread real-time MELPe implementations running under <a href=\"\/pdf\/MELPePackageFactSheetPOSIX.pdf\">Windows, Unix, Linux, MacOS<\/a> etc. (such implementations can run around 10 channels with today&#8217;s CPU).\n\n<h3 align=\"left\"><a name=\"Q11\"><\/a>11. MELPe IPR AND LICENSING COMPANDENT&#8217;S MELPe<\/h3>\n<b> <a name=\"Q11.1\"><\/a>11.1 Q: Suppose I developed MELPe implementation based on the standard, or obtained such from some source other than Compandent and I use it commercially, do I still need to pay any royalty to Compandent? (where commercially means any use other than the U.S. government or NATO or Partnership for Peace governments)<\/b><br \/>\nA: Regardless of where you got your MELPe implementation from, the answer is <strong>YES<\/strong>, if your implementation uses the MELPe standard reference that includes Compandent&#8217;s contributions. Compandent has made numerous contributions to the MELPe standard reference (see for example USCO certificate of copyright registration numbers: <a href=\"https:\/\/cocatalog.loc.gov\/cgi-bin\/Pwebrecon.cgi?Search_Arg=TX0006703781&amp;Search_Code=REGS&amp;PID=2324&amp;SEQ=20080514124830&amp;CNT=25&amp;HIST=1\">TX0006703781 (postfilt.asm)<\/a>, <a href=\"https:\/\/cocatalog.loc.gov\/cgi-bin\/Pwebrecon.cgi?Search_Arg=TX0006845325&amp;Search_Code=REGS&amp;PID=2324&amp;SEQ=20080514124830&amp;CNT=25&amp;HIST=1\">TX0006845325 (lpc_lib.asm)<\/a>, <a href=\"https:\/\/cocatalog.loc.gov\/cgi-bin\/Pwebrecon.cgi?Search_Arg=TX0007161044&amp;Search_Code=REGS&amp;PID=2324&amp;SEQ=20080514124830&amp;CNT=25&amp;HIST=1\">TX0007161044 (lpc_lib.c)<\/a>) , and many more. We reserve all our rights in it. We can provide you a complete list of our contributions upon request. Any party intending to develop products based on MELPe and use them commercially should contact Compandent regarding licensing terms and conditions, unless he or she is satisfied that said products do not contain Compandent&#8217;s IP in the MELPe reference implementation. We also encourage you to contact all other IPR holders.\n\n<h3 align=\"left\"><a name=\"Q12\"><\/a>12. IMPORTANT NOTES TO DEFENSE CONTRACTOR RE MELP \/ MELPe<\/h3>\n<b> <a name=\"Q12.1\"><\/a>12.1 Q: Is MELP \/ MELPe HW &amp; SW COTS and\/or POSIX?<\/b><br \/>\nA: Yes, the MELP \/ MELPe related software and hardware is COTS and is available in various platforms and form factors such as COTS processors or chips, boards and portable devices. Easy to integrate &amp; maintain COTS MELPe software is available in commonly used programming languages for COTS processors in floating-point and\/or fixed-point arithmetic. Compandent also created multi-channel POSIX compliant MELPe real-time implementation for various operating systems such as <a href=\"https:\/\/melpe.org\/pdf\/MELPePackageFactSheetPOSIX.pdf\">Unix, Linux, Windows PC, MacOS<\/a>, etc.. For more information see: <a href=\"https:\/\/melp.org\/defensecontract\/\">Note to Defense Contractor Management and Engineering<\/a>.\n<b> <a name=\"Q12.2\"><\/a>12.2 Q: Why is Compandent&#8217;s MELP \/ MELPe package better?<\/b><br \/>\nA: Engineers who are not yet familiar with the MELP \/ MELPe code may mistakenly assume that the code they may have access to can easily be ported to and integrated in existing COTS hardware. But they may be in for a surprise! For more information re Why? and What we did to take the MELPe package to the next level please see: <a href=\"https:\/\/melp.org\/defensecontract\/\">Note to Defense Contractor Management and Engineering<\/a>.\n<b> <a name=\"Q12.3\"><\/a>12.3 Q: What should defense contractor management be aware of?<\/b><br \/>\nA: Fixing the existing issues in the MELP \/ MELPe standard reference is time-consuming and is likely to take several good months even for a highly competent and experienced DSP engineer. The Compandent&#8217;s MELPe suite (a.k.a <strong>MELPe++<\/strong> or <strong>MELPe-Plus-Plus<\/strong>) can save you the time, the risk, the uncertainty, and the need to recreate what is already available as COTS. For more information see: <a href=\"https:\/\/melp.org\/defensecontract\/\">Note to Defense Contractor Management and Engineering<\/a>.\n<b> <a name=\"Q12.4\"><\/a>12.4 Q: How can I quickly hook-up and test your MELPe with military equipment?<\/b><br \/>\nA: Compandent offers low-cost Data-Terminal Equipment (DTE) such as <a href=\"https:\/\/melp.org\/melpehw\/\">FLEXI-232<\/a> and <a href=\"https:\/\/melp.org\/melpehw\/\">FLEXI-PC104<\/a> for interfacing MELPe vocoders with external devices such as Rockwell Collins MDM-3001 and other modems.\n\n<h3 align=\"left\"><a name=\"Q13\"><\/a>13. BIT ERRORS AND FRAME ERASURE<\/h3>\n<b> <a name=\"Q13.1\"><\/a>13.1 Q: Does MELPe utilize error correction coding?<\/b><br \/>\nA: Yes, MELPe does utilize some level of forward error correction codes (FEC) incorporated in the MELPe bit-stream. Beyond that, you may add your own error correction and\/or encryption.\n<b> <a name=\"Q13.2\"><\/a>13.2 Q: What about Frame Erasure, Burst Error, and Error Concealment?<\/b><br \/>\nA: Our MELPe is &#8220;packetized-network-ready&#8221;. It accepts signals for frame erasure or burst error, and utilizes special techniques for error concealment in order to maintain its quality even in severe Frame Erasure Rate (FER) conditions. See demo at: <a href=\"https:\/\/melp.org\/melpesw\/#MELPeDemo\">www.MELPe.com<\/a>\n\n<h3 align=\"left\"><a name=\"Q14\"><\/a>14. OTHER MELPe RELATED SOFTWARE AND FEATURES<\/h3>\n<b> <a name=\"Q14.1\"><\/a>14.1 Q: Can Compandent&#8217;s MELPe be used as variable-rate coder?<\/b><br \/>\nA: Yes of course! Compandent&#8217;s MELPe can switch rates and other parameters on the fly. We can also provide you with an algorithm to adjust the vocoder rate dynamically.\n<b> <a name=\"Q14.2\"><\/a>14.2 Q: Can you transcode between MELPe and other coders such as G.729D, or other G.7xx?<\/b><br \/>\nA: Yes, we can provide you with excellent solutions for transcoding between MELPe and G729D or any other vocoder.\n<b> <a name=\"Q14.3\"><\/a>14.3 Q: How can I perform bitstream sync acquisition that would work even in noisy channel conditions (i.e. in the presence of bit error)?<\/b><br \/>\nA: Compandent has developed a fast and robust algorithm for bitstream sync acquisition that is capable of tracking the synchronization signaling even in noisy channel conditions. It is useful for MELP, MELPe, and other vocoders.\n\n<p>&nbsp;<\/p>\n\n\t\t<h3>MELCODER &#8211; NSA &#038; NATO&#8217;s MELPe Test-Bed<\/h3>\n\t\t<p>MELCODER &#8211; NSA &amp; NATO&#8217;s MELPe Test-Bed developed by Compandent and used as the &#8220;Gold-Standard&#8221;<\/p>\n\t\t\t<a href=\"\/melcoder\/\" target=\"_self\" role=\"button\" rel=\"noopener\">\n\t\t\t\t\t\t\tMELCODER the &#8220;Gold-Standard&#8221;\n\t\t\t\t\t<\/a>\n\n","protected":false},"excerpt":{"rendered":"<p>FAQ Table Of Content 1. INTRODUCTION AND GENERAL INFORMATION 1.0 Where can I find more information about the history of&hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"class_list":["post-235","page","type-page","status-publish","hentry"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>MELPe STANAG-4591 Frequently Asked Questions (FAQ) - MELP Vocoder<\/title>\n<meta name=\"description\" content=\"FAQ Table Of Content 1. INTRODUCTION AND GENERAL INFORMATION 1.0 Where can I find more information about the history of Secure Voice Coding? 1.1 Where can\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/melp.org\/melp_faq\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"MELPe STANAG-4591 Frequently Asked Questions (FAQ) - MELP Vocoder\" \/>\n<meta property=\"og:description\" content=\"FAQ Table Of Content 1. INTRODUCTION AND GENERAL INFORMATION 1.0 Where can I find more information about the history of Secure Voice Coding? 1.1 Where can\" \/>\n<meta property=\"og:url\" content=\"https:\/\/melp.org\/melp_faq\/\" \/>\n<meta property=\"og:site_name\" content=\"MELP Vocoder\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/pages\/Compandent\/277707692295343\" \/>\n<meta property=\"article:modified_time\" content=\"2021-02-16T21:13:39+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@compandent\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"24 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/melp.org\/melp_faq\/\",\"url\":\"https:\/\/melp.org\/melp_faq\/\",\"name\":\"MELPe STANAG-4591 Frequently Asked Questions (FAQ) - MELP Vocoder\",\"isPartOf\":{\"@id\":\"https:\/\/melp.org\/#website\"},\"datePublished\":\"2018-10-25T23:08:48+00:00\",\"dateModified\":\"2021-02-16T21:13:39+00:00\",\"description\":\"FAQ Table Of Content 1. INTRODUCTION AND GENERAL INFORMATION 1.0 Where can I find more information about the history of Secure Voice Coding? 1.1 Where can\",\"breadcrumb\":{\"@id\":\"https:\/\/melp.org\/melp_faq\/#breadcrumb\"},\"inLanguage\":\"en\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/melp.org\/melp_faq\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/melp.org\/melp_faq\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/melp.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"MELPe STANAG-4591 Frequently Asked Questions (FAQ)\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/melp.org\/#website\",\"url\":\"https:\/\/melp.org\/\",\"name\":\"MELP Vocoder\",\"description\":\"Mixed Excitation Linear Predictive (MELP) codec\",\"publisher\":{\"@id\":\"https:\/\/melp.org\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/melp.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/melp.org\/#organization\",\"name\":\"MELP.org\",\"url\":\"https:\/\/melp.org\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en\",\"@id\":\"https:\/\/melp.org\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/melp.org\/wp-content\/uploads\/2018\/10\/Compandent-logo1shade.gif\",\"contentUrl\":\"https:\/\/melp.org\/wp-content\/uploads\/2018\/10\/Compandent-logo1shade.gif\",\"width\":559,\"height\":644,\"caption\":\"MELP.org\"},\"image\":{\"@id\":\"https:\/\/melp.org\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/pages\/Compandent\/277707692295343\",\"https:\/\/x.com\/compandent\",\"https:\/\/www.linkedin.com\/company\/compandent\/\",\"https:\/\/youtu.be\/na4ziAbKAX8\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"MELPe STANAG-4591 Frequently Asked Questions (FAQ) - MELP Vocoder","description":"FAQ Table Of Content 1. INTRODUCTION AND GENERAL INFORMATION 1.0 Where can I find more information about the history of Secure Voice Coding? 1.1 Where can","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/melp.org\/melp_faq\/","og_locale":"en_US","og_type":"article","og_title":"MELPe STANAG-4591 Frequently Asked Questions (FAQ) - MELP Vocoder","og_description":"FAQ Table Of Content 1. INTRODUCTION AND GENERAL INFORMATION 1.0 Where can I find more information about the history of Secure Voice Coding? 1.1 Where can","og_url":"https:\/\/melp.org\/melp_faq\/","og_site_name":"MELP Vocoder","article_publisher":"https:\/\/www.facebook.com\/pages\/Compandent\/277707692295343","article_modified_time":"2021-02-16T21:13:39+00:00","twitter_card":"summary_large_image","twitter_site":"@compandent","twitter_misc":{"Est. reading time":"24 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/melp.org\/melp_faq\/","url":"https:\/\/melp.org\/melp_faq\/","name":"MELPe STANAG-4591 Frequently Asked Questions (FAQ) - MELP Vocoder","isPartOf":{"@id":"https:\/\/melp.org\/#website"},"datePublished":"2018-10-25T23:08:48+00:00","dateModified":"2021-02-16T21:13:39+00:00","description":"FAQ Table Of Content 1. INTRODUCTION AND GENERAL INFORMATION 1.0 Where can I find more information about the history of Secure Voice Coding? 1.1 Where can","breadcrumb":{"@id":"https:\/\/melp.org\/melp_faq\/#breadcrumb"},"inLanguage":"en","potentialAction":[{"@type":"ReadAction","target":["https:\/\/melp.org\/melp_faq\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/melp.org\/melp_faq\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/melp.org\/"},{"@type":"ListItem","position":2,"name":"MELPe STANAG-4591 Frequently Asked Questions (FAQ)"}]},{"@type":"WebSite","@id":"https:\/\/melp.org\/#website","url":"https:\/\/melp.org\/","name":"MELP Vocoder","description":"Mixed Excitation Linear Predictive (MELP) codec","publisher":{"@id":"https:\/\/melp.org\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/melp.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en"},{"@type":"Organization","@id":"https:\/\/melp.org\/#organization","name":"MELP.org","url":"https:\/\/melp.org\/","logo":{"@type":"ImageObject","inLanguage":"en","@id":"https:\/\/melp.org\/#\/schema\/logo\/image\/","url":"https:\/\/melp.org\/wp-content\/uploads\/2018\/10\/Compandent-logo1shade.gif","contentUrl":"https:\/\/melp.org\/wp-content\/uploads\/2018\/10\/Compandent-logo1shade.gif","width":559,"height":644,"caption":"MELP.org"},"image":{"@id":"https:\/\/melp.org\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/pages\/Compandent\/277707692295343","https:\/\/x.com\/compandent","https:\/\/www.linkedin.com\/company\/compandent\/","https:\/\/youtu.be\/na4ziAbKAX8"]}]}},"_links":{"self":[{"href":"https:\/\/melp.org\/wp-json\/wp\/v2\/pages\/235","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/melp.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/melp.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/melp.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/melp.org\/wp-json\/wp\/v2\/comments?post=235"}],"version-history":[{"count":0,"href":"https:\/\/melp.org\/wp-json\/wp\/v2\/pages\/235\/revisions"}],"wp:attachment":[{"href":"https:\/\/melp.org\/wp-json\/wp\/v2\/media?parent=235"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}